# Project 2:  Lucid Titanic Sleuthing

## Part 1: Developing an understanding of the data

#### Based on the description of the data you read in the readme describe in your own words this data.

There are two datasets that represents information about passangers and the crew of two ships, Titanic and Lusitania, and the fate of them, whether they survived or not.

#### Based on our conceptual understanding of the columns in this data set.  What are the reasonable range of the values for the Sex, Age, SibSp, Parch columns.

In [3]:
%autosave 600

Autosaving every 600 seconds

### Open the data in sublime text is there anything that jumps out to you?

## Part 2: reading the data in

In [84]:
Lus_Age_Uniq = Lusitania_df['Age'].unique()
List_Bad_Char = [list(str(x)) for x in Lus_Age_Uniq]
finallist = []
for a in List_Bad_Char:
    for b in range(len(a)):
        c = a[b]
        finallist.append(c)
myset = set(finallist)
#myset

#### Now read the data into a Pandas DataFrame

In [74]:
titanic_data_location = 'assets/titanic.csv'
lusitania_data_location = 'assets/lusitania.csv'
import pandas as pd
import numpy as np
Titanic_df = pd.read_csv(titanic_data_location)
Lusitania_df = pd.read_csv(lusitania_data_location)

In [46]:
print (Titanic_df.dtypes)
print (Titanic_df.shape)

pclass         int64
survived       int64
name          object
sex           object
age          float64
sibsp          int64
parch          int64
ticket        object
fare         float64
cabin         object
embarked      object
boat          object
body         float64
home.dest     object
dtype: object
(1309, 14)

In [21]:
Titan_columns_of_interest = ['pclass', 'sruvived', 'sex', 'age', 'parch', 'cabin','boat','home.dest']

#### Check that the age column doesn't have any unreasonable values

In [22]:
print (Titanic_df['age'].unique())

[ 29.     0.92   2.    30.    25.    48.    63.    39.    53.    71.    47.
  18.    24.    26.    80.      nan  50.    32.    36.    37.    42.    19.
  35.    28.    45.    40.    58.    22.    41.    44.    59.    60.    33.
  17.    11.    14.    49.    76.    46.    27.    64.    55.    70.    38.
  51.    31.     4.    54.    23.    43.    52.    16.    32.5   21.    15.
  65.    28.5   45.5   56.    13.    61.    34.     6.    57.    62.    67.
   1.    12.    20.     0.83   8.     0.67   7.     3.    36.5   18.5    5.
  66.     9.     0.75  70.5   22.5    0.33   0.17  40.5   10.    23.5   34.5
  20.5   30.5   55.5   38.5   14.5   24.5   60.5   74.     0.42  11.5   26.5 ]

There are null values in the age column. It appears that for ages under 1 year, the data is year form which is consistant with the rest of the data.

In [10]:
print (Lusitania_df['Age'].unique())

['38' '37' '30' '25' '27' '48' nan '24' '19 ?' '57' '50' '56' '41' '19'
 '33' '29' '18' '20' '21' '26' '17' '58' '47' '54' '35' '43' '59' '53' '44'
 '51' '40' '49' '42' '32' '31' '34' '22' '45' '36' '29 ?' '52' '23' '60'
 '28' '16' '46' '15' '39' '63 ?' '55' '64' '53 ?' '09-months' '6' '9' '14'
 '10' '12' '?' '62' '5' '8' '65' '68' '76' '61' '63' '03-months' '1.5'
 '2.5' '18-months' '3' '2' '25 ?' '08-months' '4' '15-months' '14-months'
 'Infant' '3-6-months ?' '51 or 47' '45 or 51' '22 (?)' '17-months'
 '13-months' '02-months' '49 ?' '05-months' '11' '59 (64?)' '63 (51?)'
 '37 (39?)' '32 (22?)' '31 (32?)' '24 (23?)' '27?' '7' '42?' '31 ?'
 '10-months' '38 (?)' '70' '62 (?)' '06-months' '13' '2_' '11-months'
 '30 ?' '34?' '1' '39 (47?)' '67' '73' '72' '11-months (3?)' '4.25' '69'
 '26?' '54?' '21?' '16 ?']

Lusitania's values under the age column are very messy. In addition to null data it has special characters, word 'month' and some with amb

#### Check for missing values.  How do you know that a value is missing?

In [47]:
Titanic_age_is_null = pd.isnull(Titanic_df['age'])
Titanic_missing_ages = Titanic_df[Titanic_age_is_null==True]
Titanic_missing_ages.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
15,1,0,"Baumann, Mr. John D",male,NaN,0,0,PC 17318,25.9250,NaN,S,NaN,NaN,"New York, NY"
37,1,1,"Bradley, Mr. George (""George Arthur Brayton"")",male,NaN,0,0,111427,26.5500,NaN,S,9,NaN,"Los Angeles, CA"
40,1,0,"Brewe, Dr. Arthur Jackson",male,NaN,0,0,112379,39.6000,NaN,C,NaN,NaN,"Philadelphia, PA"
46,1,0,"Cairns, Mr. Alexander",male,NaN,0,0,113798,31.0000,NaN,S,NaN,NaN,NaN
59,1,1,"Cassebeer, Mrs. Henry Arthur Jr (Eleanor Genev...",female,NaN,0,0,17770,27.7208,NaN,C,5,NaN,"New York, NY"

#### Does it makes sense to guess at the value?

Out of 1308 entries, 263 do not have age information. That is about 20% of the
data which could potentially throw off the analysis on age. However, guessing
the age would not be advisable unless we insert the mean of the available data
for all missing ages.'''

## Part 3: data imputation

#### Well let’s say that it does... You likely noticed that Age has some missing values. How many are missing?

In [48]:
len(Titanic_missing_ages)

263

#### For the Age of the passangers ... how would you guess at the missing values using the other data present in the CSV.

In [49]:
Titanic_average_age = np.mean(Titanic_df['age'])
round(Titanic_average_age, 2)

29.88

In [75]:
Titanic_df['age'].fillna(Titanic_average_age, inplace=True)
Titanic_age_is_null = pd.isnull(Titanic_df['age'])
Titanic_missing_ages = Titanic_df[Titanic_age_is_null==True]
print(Titanic_missing_ages.head())
Titanic_average_age = np.mean(Titanic_df['age'])
round(Titanic_average_age, 2)

Empty DataFrame
Columns: [pclass, survived, name, sex, age, sibsp, parch, ticket, fare, cabin, embarked, boat, body, home.dest]
Index: []

29.88

## Part 4: Group Statistics

#### Are there any groups that were especially adversely affected in the Titanic wreck? (justify your response numerically)

In [181]:
Age_group = []

RangeIndex(start=0, stop=1309, step=1)

In [192]:
Age_group = []
for x in Titanic_df['age']:
    if x == Titanic_average_age:
        Age_group.append('unkown')
    else:
        if x <= 6:
            Age_group.append('child')
        if x > 6 and x <=17:
            Age_group.append('young')    
        if x > 17 and x <=60:
            Age_group.append('adult')    
        if x > 60:
            Age_group.append('senior')  
Titanic_df['age group'] = Age_group
Tit_total_passangers = Titanic_df.index
Tit_total_females = Titanic_df.loc[Titanic_df['sex'] == 'female']
Tit_pivot_age_sex_effect = pd.pivot_table(Titanic_df, values=['survived'],columns=['sex'],\
                                          index=['age group'],aggfunc=[sum,len],margins=True)
Tit_pivot_age_sex_effect['Female Survival Ratio %'] = ((Tit_pivot_age_sex_effect['sum'])\
                                                     ['survived'])['female']*100/((Tit_pivot_age_sex_effect['len'])\
                                                                                  ['survived'])['female']
Tit_pivot_age_sex_effect['Male Survival Ratio %'] = ((Tit_pivot_age_sex_effect['sum'])\
                                                     ['survived'])['male']*100/((Tit_pivot_age_sex_effect['len'])\
                                                                                  ['survived'])['male']
Tit_pivot_age_sex_effect['Age Group Survival Ratio %'] = ((Tit_pivot_age_sex_effect['sum'])\
                                                     ['survived'])['All']*100/((Tit_pivot_age_sex_effect['len'])\
                                                                                  ['survived'])['All']
Tit_pivot_age_sex_effect
# Tit_pivot_age_sex_effect['Total']=[]*len(Tit_pivot_age_sex_effect)

               sum                    len                 \
          survived               survived
sex         female   male    All   female   male     All
age group
adult        236.0  102.0  338.0    309.0  550.0   859.0
child         21.0   19.0   40.0     30.0   32.0    62.0
senior         6.0    2.0    8.0      7.0   26.0    33.0
unkown        47.0   26.0   73.0     78.0  185.0   263.0
young         29.0   12.0   41.0     42.0   50.0    92.0
All          339.0  161.0  500.0    466.0  843.0  1309.0

          Female Survival Ratio % Male Survival Ratio %  \

sex
age group
adult                   76.375405             18.545455
child                   70.000000             59.375000
senior                  85.714286              7.692308
unkown                  60.256410             14.054054
young                   69.047619             24.000000
All                     72.746781             19.098458

          Age Group Survival Ratio %

sex
age group
adult                      39.348079
child                      64.516129
senior                     24.242424
unkown                     27.756654
young                      44.565217
All                        38.197097

In [193]:
Tit_pivot_class_effect = pd.pivot_table(Titanic_df, values=['survived'],index=['pclass'],\
                                          aggfunc=[sum,len],margins=True)
Tit_pivot_class_effect['Class Survival Ratio %'] = (Tit_pivot_class_effect['sum'])\
                                                     ['survived']*100/(Tit_pivot_class_effect['len'])\
                                                                                  ['survived']
Tit_pivot_class_effect

            sum      len Class Survival Ratio %
       survived survived
pclass
1         200.0    323.0              61.919505
2         119.0    277.0              42.960289
3         181.0    709.0              25.528914
All       500.0   1309.0              38.197097

In [194]:
Tit_pivot_departureport_effect = pd.pivot_table(Titanic_df, values=['survived'],index=['embarked'],\
                                          aggfunc=[sum,len],margins=True)
Tit_pivot_departureport_effect['Departure Port Survival Ratio %'] = (Tit_pivot_departureport_effect['sum'])\
                                                     ['survived']*100/(Tit_pivot_departureport_effect['len'])\
                                                                                  ['survived']
Tit_pivot_departureport_effect

              sum      len Departure Port Survival Ratio %
         survived survived
embarked
C           150.0    270.0                       55.555556
Q            44.0    123.0                       35.772358
S           304.0    914.0                       33.260394
All         498.0   1307.0                       38.102525

are people from port c more wealthy??

In [180]:
np.mean(Titanic_df.fare)

33.295479281345571

#### Are there any groups that outperformed the survival of the latter group? (justify your response numerically)

## Part 5:  Comparative Statistics:  Lusitania

#### Are there any groups that were especially adversely affected in the Titanic wreck? (justify your response numerically)

#### Are there any groups that outperformed the survival of the latter group? (justify your response numerically)

#### What does the group-wise survival rate imply about circumstances during these two accidents?

In [22]:
a = "ali"
b = a.split()
print b

['ali']

In [31]:
sample = "john,plastic,joe"
split_list = sample.split(",")
list(split_list[1])

['p', 'l', 'a', 's', 't', 'i', 'c']

In [39]:
alphabet = "a b c d e f g"
data = alphabet.split() #split string into a list
data

['a', 'b', 'c', 'd', 'e', 'f', 'g']

In [91]:
%autosave 600

Autosaving every 600 seconds